src/Documents/SoldProducts/SoldProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SoldProducts</name>
  <basedOn>Document.ImportedProducts</basedOn>
  <registerRecords>AccumulationRegister.RemainingProducts</registerRecords>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contract</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currency</types>
    </type>
  </attributes>
  <attributes>
    <name>Storage</name>
    <type>
      <types>EnumRef.Storage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Nomenclature</name>
      <type>
        <types>CatalogRef.Nomenclature</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/SoldProducts/ManagerModule.bsl
Procedure Print(Spreadsheet, Ref) Export
	//{{_PRINT_WIZARD(Print)
	Template = Documents.SoldProducts.GetTemplate("Print");
	Query = New Query;
	Query.Text =
	"SELECT
	|	SoldProducts.Contract,
	|	SoldProducts.Currency,
	|	SoldProducts.Date,
	|	SoldProducts.Number,
	|	SoldProducts.Products.(
	|		LineNumber,
	|		Nomenclature,
	|		Quantity,
	|		Price
	|	)
	|FROM
	|	Document.SoldProducts AS SoldProducts
	|WHERE
	|	SoldProducts.Ref IN (&Ref)";
	Query.Parameters.Insert("Ref", Ref);
	Selection = Query.Execute().Select();

	AreaCaption = Template.GetArea("Caption");
	Header = Template.GetArea("Header");
	AreaProductsHeader = Template.GetArea("ProductsHeader");
	AreaProducts = Template.GetArea("Products");
	Spreadsheet.Clear();

	InsertPageBreak = False;
	While Selection.Next() Do
		If InsertPageBreak Then
			Spreadsheet.PutHorizontalPageBreak();
		EndIf;

		Spreadsheet.Put(AreaCaption);

		Header.Parameters.Fill(Selection);
		Spreadsheet.Put(Header, Selection.Level());

		Spreadsheet.Put(AreaProductsHeader);
		SelectionProducts = Selection.Products.Select();
		While SelectionProducts.Next() Do
			AreaProducts.Parameters.Fill(SelectionProducts);
			Spreadsheet.Put(AreaProducts, SelectionProducts.Level());
		EndDo;

		InsertPageBreak = True;
	EndDo;
	//}}
EndProcedure
